EDT/УТ/src/Catalogs/ШаблоныСМСРассылок/ШаблоныСМСРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСМСРассылок</name>
  <attributes>
    <name>ТипСМСРассылки</name>
    <type>
      <types>CatalogRef.ТипыСМСРассылок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СклонениеИсполнителяДоставки</name>
    <type>
      <types>EnumRef.ПадежиСклонения</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/РассылкаСМС/РассылкаСМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкаСМС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСМС</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСообщения</name>
    <type>
      <types>CatalogRef.СтатусыСМССообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСМСНаш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОператорСМСРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелМП</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСМСРассылки</name>
    <type>
      <types>CatalogRef.ТипыСМСРассылок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтправкаСМС</name>
    <type>
      <types>CatalogRef.ОтправкиСМС_КУдалению</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ШаблоныСМСРассылок/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТолькоПросмотр = ПроверкаДоступностиРедактированияЗаписи();
	ЗаполнентеТаблицыПодстановки();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнентеТаблицыПодстановки()
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[ExNumber]";
	НовСтр.Расшифровка 		= "Номер заказа";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[PhoneCar]";
	НовСтр.Расшифровка 		= "Телефон экипажа";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[Summa]";
	НовСтр.Расшифровка 		= "Сумма заказа";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[SummaOplYa]";
	НовСтр.Расшифровка 		= "Сумма к оплате";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[Date]";
	НовСтр.Расшифровка 		= "Дата заказа";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[IntervalS]";
	НовСтр.Расшифровка 		= " Время прибытия с";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[IntervalPO]";
	НовСтр.Расшифровка 		= "Время прибытия по";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[IM]";
	НовСтр.Расшифровка 		= "Наименование Интернет-Магазина";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[IMLat]";
	НовСтр.Расшифровка 		= "Наименование Интернет-Магазина латиницей";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[Name]";
	НовСтр.Расшифровка 		= "Имя водителя/экспедитора";
	
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[NameLat]";
	НовСтр.Расшифровка 		= "Имя водителя/экспедитора латиницей";
	
	//+Степанов
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[customerIdentificationCode]";
	НовСтр.Расшифровка 		= "Код идентификации клиента";
	//-Степанов
	
	//Геннадий #4761 10.03.2022 ++
	НовСтр = ПодсталяемыеРеквизиты.Добавить();
	НовСтр.КодПодстановки   = "[RecipientHL]";
	НовСтр.Расшифровка 		= "Ссылка на отслеживание";
	//Геннадий #4761 --
	
КонецПроцедуры


&НаСервере
Функция ПроверкаДоступностиРедактированияЗаписи()
	РазрешеноРедактированиеШаблоновСМС = РольДоступна("РедактированиеДанныхШаблоновСМСИнформирования");
	ЭтоАдмин = РольДоступна("Админы");
	Если Не (РазрешеноРедактированиеШаблоновСМС ИЛИ ЭтоАдмин) Тогда  //Проверяем на права
		Сообщить("Разрешен только Просмотр!!!");
		Возврат Истина;
	Иначе	
		Если НЕ УжеЕстьТакойШаблон() Тогда  //Проверяем на участие шаблона и админа
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
КонецФункции


&НаСервере
Функция УжеЕстьТакойШаблон()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РассылкаСМС.Шаблон КАК Шаблон
	               |ИЗ
	               |	РегистрСведений.РассылкаСМС КАК РассылкаСМС
	               |ГДЕ
	               |	РассылкаСМС.Шаблон = &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 Тогда
		Если ЭтоАдмин Тогда
			Сообщить("Хоть вы и админ знайте: Этот ШАБЛОН УЖЕ УЧАВСТВОВАЛ В РАССЫЛКЕ!!!");
			Возврат Ложь;
		Иначе
			Сообщить("Этот ШАБЛОН УЖЕ УЧАВСТВОВАЛ В РАССЫЛКЕ!!!Разрешен только просмотр!!!");
			Возврат Истина;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодсталяемыеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтаФорма.ТолькоПросмотр = Ложь Тогда
		КодПодстановки = Элементы.ПодсталяемыеРеквизиты.ТекущиеДанные.КодПодстановки;
		Элементы.ТекстШаблона.ВыделенныйТекст = " " + КодПодстановки + " ";
		Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона,Символы.ПС," ");
		Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона,"  "," ");
		Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона,"  "," "); //х2 проверка на двойные пробелы
		Объект.ТекстШаблона = СокрЛП(Объект.ТекстШаблона);
	КонецЕсли;
КонецПроцедуры
